	//卷烟机
	//首检原因
	var arryKey=["-","①","②","③","④","⑤","⑥","⑦"];
	var arryVal=["-","①接班开机","②班中餐","③设备停机超30分钟(含正常停机和故障停机)",
				"④材料换版","⑤更换牌号","⑥轮保后开机","⑦其他"];
	//外观缺陷代码
	var qxKey=[ "-","0","A","B","C","D","E",
				"F","G","H","I","J","K",
				"L","M","N","P","Q","R",
				"S","T","X","Z","Y"];
	var qxVal=["-","0无质量问题","A烟支空头","B烟支缩头","C烟支切口不齐","D卷接暴口","E搭扣粘帖不牢固",
	           "F烟支卷接夹末","G滤嘴脱落","H漏气","I烟支滤嘴变形","J烟支接装纸长短","K烟支接装纸破损",
	           "L烟支滤嘴泡皱","M烟支接装纸错位","N烟支接装纸翘边","P烟支断残","Q烟支破损","R烟支钢印不全",
	           "S烟支表面污脏、不洁","T烟支表面皱","X其他","Z长度超标","Y圆周超标"];
	//处理措施
	var csKey=["-","0","①","②","③","④","⑤"];
	var csVal=["-","无质量问题","①机台处理","②反馈","③报告班长","④故障部位修理","⑤按不合格品程序处理"];

	//供 过程自检记录使用
	var cpdKey=["4","10","20","30","50","70","80","100"];//产品段
	var cpdVal=["4","10","20","30","50","70","80","100"];
	//判断
	var isTrueKey=["-","√","×"];
	var isTrueVal=["-","对","错"];
	//复检选项
	var isFjKey=["-","√"];
	var isFjVal=["-","复检"];
	//不合格情况
	var notFitKey=["-","A"];
	var notFitVal=["无需填写","外观不符合"];
	//过程自检记录备注
	var commentskey=["-","物料错误","物料损坏","物料代码不正确","监测系统关闭","检测系统失效","检测系统灵敏度不高"];
	var commentsval=["-","物料错误","物料损坏","物料代码不正确","监测系统关闭","检测系统失效","检测系统灵敏度不高"];
	
	//不合格情况
	var standkey=["-","保养",'班中餐','设备维修'];
	var standval=["-","保养",'班中餐','设备维修'];
	
	
	var remark_wirte="1.检验时间按24小时制填写。<br/>";
	remark_wirte+="2.外观质量情况栏填写，当检验无质量问题，则在填写“0”；<br/>";
	remark_wirte+="如有质量问题，则必须填写质量缺陷代码，不合格数量（以支为单位）填写在后面；<br/>";
	remark_wirte+="若属“其它”质量缺陷，首检应直接描述缺陷和数量，过程检验应在“备注”栏内注明缺陷具体的名称。<br/>";
	remark_wirte+="3.若当前检验合格，则在“判断”栏内划“√”，“复检”栏划“-”；<br/>";
	remark_wirte+="若当次检验不合格，则在“判断”栏内划“错”，并进行复检,根据复检结果在“复检栏”划“√”或“×”。<br/>";
	remark_wirte+="4.“产品段”栏填写检验时机台产量，单位为万支。<br/>";
	remark_wirte+="5.表中结合实际无需填写项目和空余栏均划“-”。<br/><br/>";
	remark_wirte+="代码说明<br/>";
	remark_wirte+="首检原因选择：①接班开机,②班中餐,③设备停机超30分钟(含正常停机和故障停机),④材料换版,⑤更换牌号,⑥轮保后开机,⑦其他<br/>";
	remark_wirte+="处理措施选择：①机台处理,②反馈,③报告班长,④故障部位修理,⑤按不合格品程序处理<br/>";
	remark_wirte+="外观缺陷代码：A烟支空头,B烟支缩头,C烟支切口不齐,D卷接暴口,E搭扣粘帖不牢固,F烟支卷接夹末,G滤嘴脱落,H漏气,I烟支滤嘴变形,J烟支接装纸长短,K烟支接装纸破损,L烟支滤嘴泡皱,M烟支接装纸错位,N烟支接装纸翘边,P烟支断残,Q烟支破损,R烟支钢印不全,S烟支表面污脏、不洁,T烟支表面皱,X其他,Z长度超标,Y圆周超标<br/>";
	remark_wirte+="<br/>";
	
	//包装机
	//首检原因选择 同卷烟机
	
	//处理措施选择 同卷烟机
	
	//暂不使用
	//盒装质量缺陷代码：a盒装粘贴不牢/b盒装启盖不畅/d盒装污脏/e盒装脱色、划痕/f盒装错位/g盒装免角/h盒装烙痕/i盒装内衬纸残缺/j盒装内衬纸高低/k框架纸缺陷/m封签缺陷/n盒装钢印残缺/q盒装断残烟支/r盒装滤嘴脱落/t盒装缺支/v盒装短支
	var qx_pack_hzKey=["-","0","a","b","d","e","f","g","h","i","j","k","m","n","q","r","t","v"];
	var qx_pack_hzVal=["-","0无质量问题","a盒装粘贴不牢","b盒装启盖不畅","d盒装污脏","e盒装脱色、划痕","f盒装错位","g盒装免角","h盒装烙痕","i盒装内衬纸残缺","j盒装内衬纸高低","k框架纸缺陷","m封签缺陷","n盒装钢印残缺","q盒装断残烟支","r盒装滤嘴脱落","t盒装缺支","v盒装短支"];
	
	//条装质量缺陷代码：A条装透明纸包装不完整/B条装透明纸破损 /C条装透明纸折皱 /D条装拉线缺陷 /E条装钢印残缺 /F条装开边 /G条装脏污/H条装脱色、划痕 /I条装条盒不方正 /J条装条翘边/L条装烙痕 /M条装凹陷 /N盒透明纸松/P盒装透明纸折皱/Q盒装透明纸松/R盒装透明纸划痕/U其他
	var qx_pack_tzKey=["-","0","A","B","C","D","E","F","G","H","I","J","L","M","N","P","R","U"];
	var qx_pack_tzVal=["-","0无质量问题","A条装透明纸包装不完整","B条装透明纸破损 ","C条装透明纸折皱 ","D条装拉线缺陷 ","E条装钢印残缺 ","F条装开边 ","G条装脏污","H条装脱色、划痕 ","I条装条盒不方正 ","J条装条翘边","L条装烙痕 ","M条装凹陷 ","N盒透明纸松","P盒装透明纸折皱","R盒装透明纸划痕","U其他"];
	//暂不使用
	//箱装质量缺陷代码：(1)烟箱错用、(2)烟箱印刷不完整、(3)烟箱破损、(4)箱装露烟、(5)胶带错用、(6)胶带不牢或翘起、(7)少条、(8)烟条挤坏
	var qx_pack_xzKey=["0","1","2","3","4","5","6","7","8"];
	var qx_pack_xzKey=["0无质量问题","(1)烟箱错用","(2)烟箱印刷不完整","(3)烟箱破损","(4)箱装露烟","(5)胶带错用","(6)胶带不牢或翘起","(7)少条","(8)烟条挤坏"];
	
	//质量缺陷代码汇总
	
	var qx_pack_key=["-","0","a","b","d","e","f","g","h","i","j","k","m","n","q","r","t","v","A","B","C","D","E","F","G","H","I","J","L","M","N","P","R","U"];
	var qx_pack_val=["-","0无质量问题","a盒装粘贴不牢","b盒装启盖不畅","d盒装污脏","e盒装脱色、划痕","f盒装错位","g盒装免角","h盒装烙痕","i盒装内衬纸残缺","j盒装内衬纸高低","k框架纸缺陷","m封签缺陷","n盒装钢印残缺","q盒装断残烟支","r盒装滤嘴脱落","t盒装缺支","v盒装短支","A条装透明纸包装不完整","B条装透明纸破损 ","C条装透明纸折皱 ","D条装拉线缺陷 ","E条装钢印残缺 ","F条装开边 ","G条装脏污","H条装脱色、划痕 ","I条装条盒不方正 ","J条装条翘边","L条装烙痕 ","M条装凹陷 ","N盒透明纸松","P盒装透明纸折皱","R盒装透明纸划痕","U其他"];
	
	//卷包机台设备自检备注
	var remark_wirte_pack="填写说明<br/>";
	remark_wirte_pack+="1．检验时间按24小时制填写<br/>";
	remark_wirte_pack+="2．外观质量情况栏填写，当次检验无质量问题，则在填写“0”；如有质量问题，则必须填写质量缺陷代码，不合格数量（以条/包/支为单位）填写在后面；若属“其它”质量缺陷，首检应直接描述缺陷和数量，过程检验应在“备注”栏内注明缺陷具体的名称。<br/>";
	remark_wirte_pack+="3．若当次检验合格，则在“判断”栏内划“√”，“复检”栏划“——”；若当次检验不合格，则在“判断”栏划“×”，并进行复检，根据复检结果在“复检栏”划“√”或“×”。<br/>";
	remark_wirte_pack+="4．表中结合实际无需填写项目和空余栏均划“——”。<br/>";
	remark_wirte_pack+="5．产品段栏填写检验时的产量，单位为件。<br/><br/>";
	
	remark_wirte_pack+="代码说明<br/>";
	remark_wirte_pack+="首检原因选择：①接班开机②班中餐③设备停机超30分钟（含正常停机和故障停机）④材料换版⑤更换牌号⑥轮保后开机⑦其他<br/>";
	remark_wirte_pack+="处理措施选择：①机台处理②反馈③报告班长④故障部位修理⑤按不合格品程序处理<br/>";
	remark_wirte_pack+="质量缺陷代码：a盒装粘贴不牢/b盒装启盖不畅/d盒装污脏/e盒装脱色、划痕/f盒装错位/g盒装免角/h盒装烙痕/i盒装内衬纸残缺/j盒装内衬纸高低/k框架纸缺陷/m封签缺陷/n盒装钢印残缺/q盒装断残烟支/r盒装滤嘴脱落/t盒装缺支/v盒装短支<br/>";
	remark_wirte_pack+="质量缺陷代码：A条装透明纸包装不完整/B条装透明纸破损 /C条装透明纸折皱 /D条装拉线缺陷 /E条装钢印残缺 /F条装开边 /G条装脏污/H条装脱色、划痕 /I条装条盒不方正 /J条装条翘边/L条装烙痕 /M条装凹陷 /N盒透明纸松/P盒装透明纸折皱/Q盒装透明纸松/R盒装透明纸划痕/U其他<br/>";
	remark_wirte_pack+="质量缺陷代码：(1)烟箱错用、(2)烟箱印刷不完整、(3)烟箱破损、(4)箱装露烟、(5)胶带错用、(6)胶带不牢或翘起、(7)少条、(8)烟条挤坏<br/>";
	
	
	
	//自检质量问题数量的单位：支、包、条
	var unit_key=["-","7","8","9"];
	var unit_val=["-","支","包","条"];
	
	//包装机质量自检数量的单位：支、条、包、件
	var sealer_unit_key=["-","7","8","9","10"];
	var sealer_unit_val=["-","支","包","条","件"];
	
	//自检的备注
	var remark_key=["1","2","3"];
	var remark_val=["1","2","3"];
	
	//包装机挡车工自检数量
	var num_key=['0','1','2','3','4','5','6','7','8','9','10'];
	var num_val=['0','1','2','3','4','5','6','7','8','9','10'];
	
	
	//封箱机
	var qx_carton_key=["-","0","A","B","C","D","E","F","G","H","J","K","L"];
	var qx_carton_val=["-","0 无质量问题","A 箱装错装","B 箱装少装","C 箱装用错胶带","D 箱装胶带不牢固","E 箱装胶带粘贴不端正","F 侧面胶带长短","G 箱体变形","H 箱面污脏","J 箱盖搭口不严","K 箱体不方正","L 其他"];
	
	var remark_wirte_carton1="填写说明<br/>";
	remark_wirte_carton1+="1．检验时间按24小时制填写<br/>";
	remark_wirte_carton1+="2．外观质量情况栏填写，当次检验无质量问题，则在填写“0”；如有质量问题，则必须填写质量缺陷代码，不合格数量（以条/包/支为单位）填写在后面；若属“其它”质量缺陷，首检应直接描述缺陷和数量，过程检验应在“备注”栏内注明缺陷具体的名称。<br/>";
	remark_wirte_carton1+="3．若当次检验合格，则在“判断”栏内划“√”，“复检”栏划“——”；若当次检验不合格，则在“判断”栏划“×”，并进行复检，根据复检结果在“复检栏”划“√”或“×”。<br/>";
	remark_wirte_carton1+="4．表中结合实际无需填写项目和空余栏均划“——”。<br/>";
	remark_wirte_carton1+="5．产品段栏填写检验时的产量，单位为件。<br/><br/>";
	
	var remark_wirte_carton2="代码说明<br/>";
	remark_wirte_carton2+="首检原因选择：①接班开机②班中餐③设备停机超30分钟（含正常停机和故障停机）④材料换版⑤更换牌号⑥轮保后开机⑦其他<br/>";
	remark_wirte_carton2+="处理措施选择：①机台处理②反馈③报告班长④故障部位修理⑤按不合格品程序处理<br/>";
	remark_wirte_carton2+="质量缺陷代码：A 箱装错装 /B 箱装少装 /C 箱装用错胶带 /D 箱装胶带不牢固  /E箱装胶带粘贴不端正   /F侧面胶带长短  /G箱体变形  /H箱面污脏  /J箱盖搭口不严  /K箱体不方正  /L其他<br/>";
	
	var remark_wirte_carton=remark_wirte_carton1+remark_wirte_carton2;
	//成型机
	var qx_filter_key1=["-","0","A","B","C","D","E","F","G","H","I","J","K","L","M","N","X"];
	var qx_filter_val1=["-","0无质量问题","A滤嘴长","B滤嘴短","C缩头","D皱纹","E搭口粘贴不齐","F翘边","G爆口","H切口毛渣","I触头","J搭口平台","K圆周超标","L胶孔","M切口抽丝","N滤棒重量（10支）超标","X其它"];
	
	var qx_filter_key2=["-","0","a","b","d","e","f","g"];
	var qx_filter_val2=["-","0无质量问题","a外观破损","b受潮","d虫蛀","e霉变","f异味","g其他"];
	
	var cs_filter_key=["-","①","②","③","④","⑤"];
	var cs_filter_val=["-","①报告班长","②监护使用","③退料","④追溯","⑤按不合格品控制程序"];
	
	//自检质量问题数量的单位：支、包、条
	var unit_filter_key=["-","7"];
	var unit_filter_val=["-","支"];
	
	var remark_wirte_filter="填写说明：<br/>";
	remark_wirte_filter+="1．检验时间按24小时制填写。<br/>";
	remark_wirte_filter+="2．质量情况栏、外观栏、检查结果栏填写，当次检验无质量问题，则在填写“0”；如有质量问题，则必须填写质量缺陷代码，不合格数量（以支为单位）填写在后面；若属“其它”质量缺陷，首检应直接描述缺陷和数量，过程检验应在“备注”栏内注明缺陷具体的名称。<br/>";
	remark_wirte_filter+="3．若当次检验合格，则在“判断”栏内划“√”，；若当次检验不合格，则在“判断”栏划“×”。<br/>";
	remark_wirte_filter+="4．“产品过程检验记录中”的“负”“正”项目分别填写“超下限支数”“超上限支数”。<br/>";
	remark_wirte_filter+="5．表中结合实际无需填写项目和空余栏均划“——”<br/><br/>";
	
	remark_wirte_filter+="产品检验<br/>";
	remark_wirte_filter+="首检原因选择：①接班开机②班中餐③设备停机超30分钟④材料换版⑤更换牌号⑥轮保后开机⑦其他<br/>";
	remark_wirte_filter+="外观缺陷代码：A滤嘴长/B滤嘴短/C缩头/D皱纹/E搭口粘贴不齐/F翘边/G爆口/H切口毛渣/I触头/J搭口平台/K圆周超标/L胶孔/M切口抽丝/N滤棒重量（10支）超标/X其它<br/>";
	remark_wirte_filter+="处理措施选择：①机台处理②反馈③报告班长④故障部位修理⑤按不合格品程序处理<br/>";
	
	remark_wirte_filter+="丝束检查<br/>";
	remark_wirte_filter+="丝束缺陷代码：a外观破损/b受潮/d虫蛀/e霉变/f异味/g其他<br/>";
	remark_wirte_filter+="处理措施选择：①报告班长②监护使用③退料④追溯⑤按不合格品控制程序<br/>";
	//获取当天的 时分，format 00:00
	function getDateHourAndMinute(){
		var now= new Date();//获取当前时间
	 	var hour=now.getHours();//时
	 	var minute=now.getMinutes();//分
		if(hour<10)hour="0"+hour;
		if(minute<10)minute="0"+minute;
		return hour+":"+minute;
	}
	//校验input 只能是整数正数
	function checkInput(v){
		//v.value=v.value.replace(/[^\d]/g,'0');
		v.value=v.value.replace(/[^\d+(\.\d+?)]/g,'0');
		
	}